// Написать программу, которая обменивает элементы первой строки и последней строки
Console.WriteLine("Hello, World!");
